[
  {
    "type": "book",
    "title": "Star Wars: Thrawn",
    "releaseDate": "2017-04-11T00:00:00Z",
    "chronoDate": -15,
    "author": "Timothy Zahn",
    "pages": 427,
    "rating": "",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Discover the origins of Grand Admiral Thrawn, one of the most cunning and ruthless warriors in the Galactic Empire. Follow his rise through the ranks as he proves his worth to Emperor Palpatine. Thrawn's tactical genius and strategic mind make him a formidable adversary, and his journey is filled with intrigue, battles, and political maneuvering. As Thrawn navigates the treacherous waters of the Empire, he faces challenges that test his loyalty and resolve. This novel delves into Thrawn's past, revealing the experiences that shaped him into the brilliant leader he becomes. With rich character development and a gripping plot, 'Star Wars: Thrawn' is a must-read for fans of the Star Wars universe, offering a deeper understanding of one of its most iconic villains."
  },
  {
    "type": "book",
    "title": "The High Republic: Quest for the Hidden City",
    "releaseDate": "2022-11-01T00:00:00Z",
    "chronoDate": -382,
    "author": "George Mann",
    "pages": 240,
    "category": "OJN",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Join the Jedi and their allies in the High Republic era as they embark on a perilous mission to uncover the secrets of a hidden city. This quest takes them to uncharted territories, where they face unknown dangers and dark forces that threaten the galaxy. The story is filled with adventure, mystery, and the timeless struggle between light and dark. As the Jedi navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. 'The High Republic: Quest for the Hidden City' offers a thrilling glimpse into a new era of the Star Wars universe, where heroes rise to confront the shadows and protect the peace."
  },
  {
    "type": "book",
    "title": "The High Republic: Convergence",
    "releaseDate": "2022-11-22T00:00:00Z",
    "chronoDate": -382,
    "author": "Zoraida Córdova",
    "pages": 336,
    "category": "ON",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "In the High Republic era, the Jedi must navigate political intrigue and dangerous alliances as they strive to maintain peace and unity in the galaxy. 'The High Republic: Convergence' explores the complex relationships and power struggles that define this period. As the Jedi work to mediate conflicts and build alliances, they face rising threats that challenge their ideals and test their resolve. The novel delves into the personal journeys of the characters, revealing their strengths, vulnerabilities, and the choices they must make in the face of adversity. With a rich tapestry of characters and a gripping narrative, this book offers a deep dive into the High Republic era, where the fate of the galaxy hangs in the balance."
  },
  {
    "type": "book",
    "title": "The High Republic: Path of Deceit",
    "releaseDate": "2022-10-04T00:00:00Z",
    "chronoDate": -382,
    "author": "Tessa Gratton, Justina Ireland",
    "pages": 352,
    "category": "YA",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Explore the dark side of the High Republic era as the Jedi uncover a sinister plot that threatens to unravel the very fabric of the galaxy. 'The High Republic: Path of Deceit' follows the Jedi as they investigate mysterious events and confront hidden dangers. The story delves into themes of trust, betrayal, and the struggle to uphold justice in a time of uncertainty. As the Jedi navigate this path of deceit, they must rely on their instincts and the strength of their bonds to uncover the truth and protect the galaxy. With a compelling narrative and richly developed characters, this novel offers a thrilling exploration of the High Republic era, where the line between light and dark is often blurred."
  },
  {
    "type": "book",
    "title": "The High Republic: The Battle of Jedha",
    "releaseDate": "2023-01-03T00:00:00Z",
    "chronoDate": -382,
    "author": "George Mann",
    "pages": 304,
    "category": "S",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Witness the epic Battle of Jedha, where the Jedi and their allies face off against formidable enemies in a struggle that will shape the future of the High Republic era. 'The High Republic: The Battle of Jedha' captures the intensity and drama of this pivotal conflict, as heroes rise to confront the darkness. The novel explores the strategies, sacrifices, and heroism that define this battle, offering a gripping narrative that keeps readers on the edge of their seats. As the Jedi fight to protect the galaxy, they must confront their own fears and doubts, finding strength in their unity and the power of the Force. This book is a must-read for fans of the High Republic era, providing a thrilling and immersive experience."
  },
  {
    "type": "book",
    "title": "The High Republic: Quest for Planet X",
    "releaseDate": "2023-04-04T00:00:00Z",
    "chronoDate": -382,
    "author": "Tessa Gratton",
    "pages": 288,
    "category": "OJR",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Join the daring quest for Planet X, a mysterious world that holds the key to untold power and knowledge. 'The High Republic: Quest for Planet X' follows the Jedi and their allies as they race against time to uncover its secrets. The journey is fraught with danger, as they navigate uncharted territories and confront dark forces that seek to exploit the planet's power. The novel explores themes of discovery, courage, and the relentless pursuit of truth. As the characters face their fears and push their limits, they must rely on their skills, wisdom, and the strength of their bonds to succeed. This book offers an exciting and immersive adventure in the High Republic era, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "The High Republic: Path of Vengeance",
    "releaseDate": "2023-05-02T00:00:00Z",
    "chronoDate": -382,
    "author": "Cavan Scott",
    "pages": 528,
    "category": "YA",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Follow the path of vengeance as the Jedi confront their darkest fears and face off against powerful adversaries in a battle that will test their strength and resolve. 'The High Republic: Path of Vengeance' delves into the personal struggles and inner conflicts of the characters, revealing their vulnerabilities and the choices they must make. The novel explores themes of revenge, redemption, and the enduring power of hope. As the Jedi navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling exploration of the High Republic era, where the line between light and dark is often blurred."
  },
  {
    "type": "book",
    "title": "The High Republic: Cataclysm",
    "releaseDate": "2023-04-04T00:00:00Z",
    "chronoDate": -382,
    "author": "Lydia Kang",
    "pages": 400,
    "category": "ON",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Experience the cataclysmic events that shake the High Republic era to its core. 'The High Republic: Cataclysm' follows the Jedi and their allies as they face unprecedented challenges and fight to protect the galaxy from destruction. The novel explores themes of resilience, sacrifice, and the enduring power of hope. As the characters navigate this tumultuous period, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling exploration of the High Republic era, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "The High Republic: Jedi Brave in Every Way",
    "releaseDate": "2023-10-10T00:00:00Z",
    "chronoDate": -232,
    "author": "Charles Soule, Rosemary Soule",
    "pages": 48,
    "category": "YR",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Discover the bravery and heroism of the Jedi in the High Republic era. 'The High Republic: Jedi Brave in Every Way' follows the Jedi as they embark on daring missions and face formidable foes to protect the galaxy and uphold justice. The novel explores themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling exploration of the High Republic era, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "The High Republic: Into the Dark",
    "releaseDate": "2021-02-02T00:00:00Z",
    "chronoDate": -232,
    "author": "Claudia Gray",
    "pages": 352,
    "category": "YA",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Journey into the dark as the Jedi navigate treacherous territory and uncover hidden dangers that threaten to disrupt the peace and stability of the High Republic era. 'The High Republic: Into the Dark' follows the Jedi as they investigate mysterious events and confront hidden dangers. The novel explores themes of trust, betrayal, and the struggle to uphold justice in a time of uncertainty. As the Jedi navigate this path of deceit, they must rely on their instincts and the strength of their bonds to uncover the truth and protect the galaxy. With a compelling narrative and richly developed characters, this novel offers a thrilling exploration of the High Republic era, where the line between light and dark is often blurred."
  },
  {
    "type": "book",
    "title": "The High Republic: Light of the Jedi",
    "releaseDate": "2021-01-05T00:00:00Z",
    "chronoDate": -232,
    "author": "Charles Soule",
    "pages": 0,
    "category": "ON",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Witness the light of the Jedi as they stand as beacons of hope and justice in the High Republic era. 'The High Republic: Light of the Jedi' follows the Jedi as they face off against dark forces and strive to maintain peace in the galaxy. The novel explores themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling exploration of the High Republic era, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "The High Republic: The Great Jedi Rescue",
    "releaseDate": "2021-01-05T00:00:00Z",
    "chronoDate": -232,
    "author": "Charles Soule",
    "pages": 24,
    "category": "YR",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Join the Great Jedi Rescue as the Jedi embark on a daring mission to save lives and protect the galaxy from imminent danger during the High Republic era. 'The High Republic: The Great Jedi Rescue' follows the Jedi as they face off against dark forces and strive to maintain peace in the galaxy. The novel explores themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling exploration of the High Republic era, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "The High Republic: A Test of Courage",
    "releaseDate": "2021-01-05T00:00:00Z",
    "chronoDate": -232,
    "author": "Justina Ireland",
    "pages": 240,
    "category": "OJR",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Experience a test of courage as young Jedi face their fears and rise to the challenge, proving their bravery and determination in the High Republic era. 'The High Republic: A Test of Courage' follows the Jedi as they navigate treacherous territory and uncover hidden dangers. The novel explores themes of trust, betrayal, and the struggle to uphold justice in a time of uncertainty. As the Jedi navigate this path of deceit, they must rely on their instincts and the strength of their bonds to uncover the truth and protect the galaxy. With a compelling narrative and richly developed characters, this novel offers a thrilling exploration of the High Republic era, where the line between light and dark is often blurred."
  },
  {
    "type": "book",
    "title": "The High Republic: The Rising Storm",
    "releaseDate": "2021-06-29T00:00:00Z",
    "chronoDate": -231,
    "author": "Cavan Scott",
    "pages": 336,
    "category": "ON",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Witness the rising storm as the Jedi and their allies confront powerful adversaries and navigate treacherous waters in their quest to maintain peace in the High Republic era. 'The High Republic: The Rising Storm' follows the Jedi as they face off against dark forces and strive to maintain peace in the galaxy. The novel explores themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling exploration of the High Republic era, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "The High Republic: Race to Crashpoint Tower",
    "releaseDate": "2021-06-29T00:00:00Z",
    "chronoDate": -231,
    "author": "Daniel José Older",
    "pages": 240,
    "category": "OJR",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Join the race to Crashpoint Tower as the Jedi and their allies embark on a high-stakes mission to protect the galaxy from a looming threat during the High Republic era. 'The High Republic: Race to Crashpoint Tower' follows the Jedi as they face off against dark forces and strive to maintain peace in the galaxy. The novel explores themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling exploration of the High Republic era, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "The High Republic: Out of the Shadows",
    "releaseDate": "2021-07-27T00:00:00Z",
    "chronoDate": -231,
    "author": "Justina Ireland",
    "pages": 423,
    "category": "OJR",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Step out of the shadows and into the light as the Jedi uncover hidden dangers and confront dark forces that threaten the peace and stability of the High Republic era. 'The High Republic: Out of the Shadows' follows the Jedi as they investigate mysterious events and confront hidden dangers. The novel explores themes of trust, betrayal, and the struggle to uphold justice in a time of uncertainty. As the Jedi navigate this path of deceit, they must rely on their instincts and the strength of their bonds to uncover the truth and protect the galaxy. With a compelling narrative and richly developed characters, this novel offers a thrilling exploration of the High Republic era, where the line between light and dark is often blurred."
  },
  {
    "type": "book",
    "title": "The High Republic: Tempest Runner",
    "releaseDate": "2021-08-31T00:00:00Z",
    "chronoDate": -231,
    "author": "Cavan Scott",
    "pages": 592,
    "category": "S",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Follow the tempest runner as they navigate the stormy waters of the High Republic era, facing formidable challenges and striving to maintain peace and order in the galaxy. 'The High Republic: Tempest Runner' follows the Jedi as they face off against dark forces and strive to maintain peace in the galaxy. The novel explores themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling exploration of the High Republic era, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "The High Republic: Mission to Disaster",
    "releaseDate": "2022-03-01T00:00:00Z",
    "chronoDate": -230,
    "author": "Justina Ireland",
    "pages": 240,
    "category": "OJR",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Embark on a mission to disaster as the Jedi and their allies face a dire threat that could plunge the galaxy into chaos during the High Republic era. 'The High Republic: Mission to Disaster' follows the Jedi as they face off against dark forces and strive to maintain peace in the galaxy. The novel explores themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling exploration of the High Republic era, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "The High Republic: Midnight Horizon",
    "releaseDate": "2022-02-01T00:00:00Z",
    "chronoDate": -230,
    "author": "Daniel José Older",
    "pages": 496,
    "category": "YA",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Journey to the midnight horizon as the Jedi and their allies confront dark forces and navigate treacherous waters in their quest to maintain peace in the High Republic era. 'The High Republic: Midnight Horizon' follows the Jedi as they face off against dark forces and strive to maintain peace in the galaxy. The novel explores themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling exploration of the High Republic era, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "The High Republic: The Fallen Star",
    "releaseDate": "2022-01-04T00:00:00Z",
    "chronoDate": -230,
    "author": "Claudia Gray",
    "pages": 0,
    "category": "ON",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Witness the fallen star as the Jedi and their allies face a dire threat that could plunge the galaxy into chaos during the High Republic era. 'The High Republic: The Fallen Star' follows the Jedi as they face off against dark forces and strive to maintain peace in the galaxy. The novel explores themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling exploration of the High Republic era, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "The High Republic: Escape from Valo",
    "releaseDate": "2024-01-30T00:00:00Z",
    "chronoDate": -229,
    "author": "Daniel José Older, Alyssa Wong",
    "pages": 384,
    "category": "OJR",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Escape from Valo as the Jedi and their allies face a dire threat that could plunge the galaxy into chaos during the High Republic era. 'The High Republic: Escape from Valo' follows the Jedi as they face off against dark forces and strive to maintain peace in the galaxy. The novel explores themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling exploration of the High Republic era, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "The High Republic: The Eye of Darkness",
    "releaseDate": "2023-11-14T00:00:00Z",
    "chronoDate": -229,
    "author": "George Mann",
    "pages": 416,
    "category": "ON",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Gaze into the eye of darkness as the Jedi and their allies face a dire threat that could plunge the galaxy into chaos during the High Republic era. 'The High Republic: The Eye of Darkness' follows the Jedi as they face off against dark forces and strive to maintain peace in the galaxy. The novel explores themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling exploration of the High Republic era, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "The High Republic: Defy the Storm",
    "releaseDate": "2024-03-05T00:00:00Z",
    "chronoDate": -228,
    "author": "Tessa Gratton, Justina Ireland",
    "pages": 464,
    "category": "YA",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Defy the storm as the Jedi and their allies face a dire threat that could plunge the galaxy into chaos during the High Republic era. 'The High Republic: Defy the Storm' follows the Jedi as they face off against dark forces and strive to maintain peace in the galaxy. The novel explores themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling exploration of the High Republic era, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "The High Republic: Temptation of the Force",
    "releaseDate": "2024-06-11T00:00:00Z",
    "chronoDate": -228,
    "author": "Tessa Gratton",
    "pages": 448,
    "category": "ON",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Resist the temptation of the Force as the Jedi and their allies face a dire threat that could plunge the galaxy into chaos during the High Republic era. 'The High Republic: Temptation of the Force' follows the Jedi as they face off against dark forces and strive to maintain peace in the galaxy. The novel explores themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling exploration of the High Republic era, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "The High Republic: Tears of the Nameless",
    "releaseDate": "2024-09-24T00:00:00Z",
    "chronoDate": -228,
    "author": "George Mann",
    "pages": 512,
    "category": "YA",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Shed tears for the nameless as the Jedi and their allies face a dire threat that could plunge the galaxy into chaos during the High Republic era. 'The High Republic: Tears of the Nameless' follows the Jedi as they face off against dark forces and strive to maintain peace in the galaxy. The novel explores themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling exploration of the High Republic era, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "The High Republic: Beware the Nameless",
    "releaseDate": "2024-08-27T00:00:00Z",
    "chronoDate": -228,
    "author": "Zoraida Córdova",
    "pages": 240,
    "category": "OJR",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Beware the nameless as the Jedi and their allies face a dire threat that could plunge the galaxy into chaos during the High Republic era. 'The High Republic: Beware the Nameless' follows the Jedi as they face off against dark forces and strive to maintain peace in the galaxy. The novel explores themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling exploration of the High Republic era, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "The High Republic: Tempest Breaker",
    "releaseDate": "2025-05-13T00:00:00Z",
    "chronoDate": -228,
    "author": "Cavan Scott",
    "pages": 528,
    "category": "S",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Break the tempest as the Jedi and their allies face a dire threat that could plunge the galaxy into chaos during the High Republic era. 'The High Republic: Tempest Breaker' follows the Jedi as they face off against dark forces and strive to maintain peace in the galaxy. The novel explores themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling exploration of the High Republic era, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "The High Republic: Trials of the Jedi",
    "releaseDate": "2025-06-17T00:00:00Z",
    "chronoDate": -229,
    "author": "Charles Soule",
    "pages": 368,
    "category": "ON",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Endure the trials of the Jedi as the Jedi and their allies face a dire threat that could plunge the galaxy into chaos during the High Republic era. 'The High Republic: Trials of the Jedi' follows the Jedi as they face off against dark forces and strive to maintain peace in the galaxy. The novel explores themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling exploration of the High Republic era, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "The High Republic: Into the Light",
    "releaseDate": "2025-04-01T00:00:00Z",
    "chronoDate": -229,
    "author": "Claudia Gray",
    "pages": 368,
    "category": "YA",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Step into the light as the Jedi and their allies face a dire threat that could plunge the galaxy into chaos during the High Republic era. 'The High Republic: Into the Light' follows the Jedi as they face off against dark forces and strive to maintain peace in the galaxy. The novel explores themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling exploration of the High Republic era, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "The High Republic: A Valiant Vow",
    "releaseDate": "2025-05-06T00:00:00Z",
    "chronoDate": -229,
    "author": "Justina Ireland",
    "pages": 272,
    "category": "OJR",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Make a valiant vow as the Jedi and their allies face a dire threat that could plunge the galaxy into chaos during the High Republic era. 'The High Republic: A Valiant Vow' follows the Jedi as they face off against dark forces and strive to maintain peace in the galaxy. The novel explores themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling exploration of the High Republic era, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "The Vow of Silver Dawn",
    "releaseDate": "2020-12-17T00:00:00Z",
    "chronoDate": -200,
    "author": "His Majesty the King",
    "pages": 324,
    "category": "ON",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Take the vow of silver dawn as the Jedi and their allies face a dire threat that could plunge the galaxy into chaos during the High Republic era. 'The Vow of Silver Dawn' follows the Jedi as they face off against dark forces and strive to maintain peace in the galaxy. The novel explores themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling exploration of the High Republic era, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "The Acolyte: Wayseeker",
    "releaseDate": "2025-05-06T00:00:00Z",
    "chronoDate": -152,
    "author": "Justina Ireland",
    "pages": 400,
    "category": "ON",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Seek the way as the Jedi and their allies face a dire threat that could plunge the galaxy into chaos during the High Republic era. 'The Acolyte: Wayseeker' follows the Jedi as they face off against dark forces and strive to maintain peace in the galaxy. The novel explores themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling exploration of the High Republic era, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "The Acolyte: The Crystal Crown",
    "releaseDate": "2025-07-29T00:00:00Z",
    "chronoDate": -138,
    "author": "Tessa Gratton",
    "pages": 416,
    "category": "ON",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Claim the crystal crown as the Jedi and their allies face a dire threat that could plunge the galaxy into chaos during the High Republic era. 'The Acolyte: The Crystal Crown' follows the Jedi as they face off against dark forces and strive to maintain peace in the galaxy. The novel explores themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling exploration of the High Republic era, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "Dooku: Jedi Lost",
    "releaseDate": "2019-04-30T00:00:00Z",
    "chronoDate": 23,
    "author": "Cavan Scott",
    "pages": 480,
    "category": "S",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Witness the fall of Dooku as the Jedi and their allies face a dire threat that could plunge the galaxy into chaos during the Fall of the Jedi era. 'Dooku: Jedi Lost' follows the Jedi as they face off against dark forces and strive to maintain peace in the galaxy. The novel explores themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling exploration of the Fall of the Jedi era, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "Padawan",
    "releaseDate": "2022-07-26T00:00:00Z",
    "chronoDate": -41,
    "author": "Kiersten White",
    "pages": 416,
    "category": "YA",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Follow the journey of a young Padawan as they navigate the challenges and trials of becoming a Jedi. 'Padawan' explores the personal growth, struggles, and triumphs of a young Jedi in training. The novel delves into themes of self-discovery, resilience, and the pursuit of knowledge. As the Padawan faces various obstacles and learns valuable lessons, they must rely on their skills, wisdom, and the guidance of their mentors to overcome the challenges ahead. With a compelling narrative and richly developed characters, this book offers an inspiring and immersive exploration of the journey to becoming a Jedi."
  },
  {
    "type": "book",
    "title": "Master & Apprentice",
    "releaseDate": "2019-04-16T00:00:00Z",
    "chronoDate": -40,
    "author": "Claudia Gray",
    "pages": 352,
    "category": "ON",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Explore the dynamic relationship between a Jedi Master and their apprentice as they navigate the challenges and trials of the Jedi Order. 'Master & Apprentice' delves into the bond between mentor and student, revealing the complexities and growth that come with this unique partnership. The novel explores themes of trust, loyalty, and the pursuit of knowledge. As the Master and Apprentice face various obstacles and learn valuable lessons, they must rely on their skills, wisdom, and the strength of their bond to overcome the challenges ahead. With a compelling narrative and richly developed characters, this book offers an insightful and immersive exploration of the Jedi Order."
  },
  {
    "type": "book",
    "title": "The Living Force",
    "releaseDate": "2024-04-09T00:00:00Z",
    "chronoDate": -33,
    "author": "John Jackson Miller",
    "pages": 432,
    "category": "ON",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Embrace the living Force as the Jedi and their allies face a dire threat that could plunge the galaxy into chaos. 'The Living Force' follows the Jedi as they face off against dark forces and strive to maintain peace in the galaxy. The novel explores themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling exploration of the Jedi Order, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "Galactic Adventures Storybook Collection",
    "releaseDate": "2018-10-02T00:00:00Z",
    "chronoDate": -33,
    "author": "Various",
    "pages": 304,
    "category": "YR",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Galactic Adventures Storybook Collection brings the epic tales of Star Wars to life in a vibrant anthology designed for young readers. Spanning 18 captivating stories across 304 pages, it reimagines pivotal moments from The Phantom Menace to The Last Jedi. Beloved heroes like Yoda, Leia, Rey, and Anakin Skywalker share the spotlight with iconic villains like Darth Vader and Darth Maul. Each story is paired with stunning illustrations, making the galaxy's battles, lightsaber duels, and acts of courage and friendship accessible and engaging. Perfect for bedtime or sparking a love for Star Wars, this collection introduces timeless adventures to a new generation. With digestible tales and dynamic art, Galactic Adventures Storybook Collection inspires and delights fans of all ages, offering a thrilling journey through the galaxy far, far away."
  },
  {
    "type": "book",
    "title": "Queen's Peril",
    "releaseDate": "2020-06-02T00:00:00Z",
    "chronoDate": -32,
    "author": "E. K. Johnston",
    "pages": 276,
    "category": "YA",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Witness the rise of Queen Amidala as she navigates the challenges and dangers of ruling Naboo. 'Queen's Peril' follows Padmé Amidala as she faces political intrigue, threats to her reign, and the responsibilities of leadership. The novel explores themes of courage, resilience, and the pursuit of justice. As Padmé confronts various obstacles and learns valuable lessons, she must rely on her skills, wisdom, and the strength of her allies to overcome the challenges ahead. With a compelling narrative and richly developed characters, this book offers an insightful and immersive exploration of Padmé's journey and the complexities of leadership."
  },
  {
    "type": "book",
    "title": "The Phantom Menace",
    "releaseDate": "2015-07-28T00:00:00Z",
    "chronoDate": -32,
    "author": "Courtney Carbone",
    "pages": 324,
    "category": "YR",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Relive the epic adventure of 'The Phantom Menace' as the Jedi and their allies face a dire threat that could plunge the galaxy into chaos. The novel follows the events of the film, exploring themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling and immersive retelling of 'The Phantom Menace,' where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "The Phantom Menace Read-Along Storybook and CD",
    "releaseDate": "2017-01-03T00:00:00Z",
    "chronoDate": -32,
    "author": "Elizabeth Schaefer",
    "pages": 32,
    "category": "YR",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Experience the adventure of 'The Phantom Menace' in a new way with this read-along storybook and CD. The novel follows the events of the film, exploring themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling and immersive retelling of 'The Phantom Menace,' where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "The Prequel Trilogy Read-Along Storybook and CD Collection",
    "releaseDate": "2019-03-05T00:00:00Z",
    "chronoDate": -32,
    "author": "Elizabeth Schaefer, Randy Thornton",
    "pages": 96,
    "category": "YR",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Experience the adventure of the prequel trilogy in a new way with this read-along storybook and CD collection. The novel follows the events of the films, exploring themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling and immersive retelling of the prequel trilogy, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "The Prequel Trilogy Stories",
    "releaseDate": "2017-09-05T00:00:00Z",
    "chronoDate": -32,
    "author": "Various",
    "pages": 304,
    "category": "YR",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Relive the epic adventure of the prequel trilogy with this collection of stories. The novel follows the events of the films, exploring themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling and immersive retelling of the prequel trilogy, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "5-Minute Star Wars Stories",
    "releaseDate": "2015-12-18T00:00:00Z",
    "chronoDate": -32,
    "author": "Various",
    "pages": 176,
    "category": "YR",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Enjoy a collection of 5-minute Star Wars stories that capture the excitement and adventure of the Star Wars universe. The novel explores themes of courage, resilience, and the enduring power of hope. As the characters navigate various challenges and learn valuable lessons, they must rely on their skills, wisdom, and the strength of their bonds to overcome the obstacles ahead. With a compelling narrative and richly developed characters, this book offers an exciting and immersive exploration of the Star Wars universe, perfect for young readers and fans of all ages."
  },
  {
    "type": "book",
    "title": "5-Minute Star Wars Stories Strike Back",
    "releaseDate": "2017-12-15T00:00:00Z",
    "chronoDate": -32,
    "author": "Various",
    "pages": 192,
    "category": "YR",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Enjoy a collection of 5-minute Star Wars stories that capture the excitement and adventure of the Star Wars universe. The novel explores themes of courage, resilience, and the enduring power of hope. As the characters navigate various challenges and learn valuable lessons, they must rely on their skills, wisdom, and the strength of their bonds to overcome the obstacles ahead. With a compelling narrative and richly developed characters, this book offers an exciting and immersive exploration of the Star Wars universe, perfect for young readers and fans of all ages."
  },
  {
    "type": "book",
    "title": "The Skywalker Saga",
    "releaseDate": "2019-10-01T00:00:00Z",
    "chronoDate": -32,
    "author": "Delilah S. Dawson",
    "pages": 400,
    "category": "YR",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Relive the epic adventure of the Skywalker saga with this collection of stories. The novel follows the events of the films, exploring themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling and immersive retelling of the Skywalker saga, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "Star Wars Galaxy of Adventures",
    "releaseDate": "2019-09-17T00:00:00Z",
    "chronoDate": -32,
    "author": "Meredith Rusu",
    "pages": 128,
    "category": "JRA",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Explore the galaxy of adventures with this collection of Star Wars stories. The novel follows the events of the films, exploring themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling and immersive exploration of the Star Wars universe, where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "Mace Windu: The Glass Abyss",
    "releaseDate": "2024-10-15T00:00:00Z",
    "chronoDate": -32,
    "author": "Steven Barnes",
    "pages": 416,
    "category": "ON",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Join Mace Windu on a thrilling adventure as he faces off against dark forces and navigates treacherous territory in his quest to maintain peace in the galaxy. 'Mace Windu: The Glass Abyss' follows the Jedi Master as he confronts formidable foes and strives to uphold justice. The novel explores themes of courage, resilience, and the enduring power of hope. As Mace Windu faces various challenges and learns valuable lessons, he must rely on his skills, wisdom, and the strength of his connection to the Force to overcome the obstacles ahead. With a gripping narrative and richly developed characters, this book offers an exciting and immersive exploration of Mace Windu's journey."
  },
  {
    "type": "book",
    "title": "Queen's Shadow",
    "releaseDate": "2019-03-05T00:00:00Z",
    "chronoDate": -28,
    "author": "E. K. Johnston",
    "pages": 345,
    "category": "YA",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Witness the rise of Queen Amidala as she navigates the challenges and dangers of ruling Naboo. 'Queen's Shadow' follows Padmé Amidala as she faces political intrigue, threats to her reign, and the responsibilities of leadership. The novel explores themes of courage, resilience, and the pursuit of justice. As Padmé confronts various obstacles and learns valuable lessons, she must rely on her skills, wisdom, and the strength of her allies to overcome the challenges ahead. With a compelling narrative and richly developed characters, this book offers an insightful and immersive exploration of Padmé's journey and the complexities of leadership."
  },
  {
    "type": "book",
    "title": "Choose Your Destiny: An Obi-Wan & Anakin Adventure",
    "releaseDate": "2019-03-19T00:00:00Z",
    "chronoDate": -28,
    "author": "Cavan Scott",
    "pages": 144,
    "category": "OJR",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Embark on an adventure with Obi-Wan Kenobi and Anakin Skywalker as they navigate the challenges and trials of the Jedi Order. 'Choose Your Destiny: An Obi-Wan & Anakin Adventure' follows the dynamic duo as they face various obstacles and learn valuable lessons. The novel explores themes of trust, loyalty, and the pursuit of knowledge. As Obi-Wan and Anakin confront formidable foes and navigate treacherous territory, they must rely on their skills, wisdom, and the strength of their bond to overcome the challenges ahead. With a compelling narrative and richly developed characters, this book offers an exciting and immersive exploration of the Jedi Order."
  },
  {
    "type": "book",
    "title": "Inquisitor: Rise of the Red Blade",
    "releaseDate": "2023-07-18T00:00:00Z",
    "chronoDate": -28,
    "author": "Delilah S. Dawson",
    "pages": 368,
    "category": "ON",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Witness the rise of the Red Blade as the Inquisitor navigates the dark side of the Force and confronts formidable foes. 'Inquisitor: Rise of the Red Blade' follows the journey of the Inquisitor as they face various challenges and learn valuable lessons. The novel explores themes of power, resilience, and the dark side of the Force. As the Inquisitor navigates treacherous territory and confronts dark forces, they must rely on their skills, cunning, and the strength of their connection to the dark side to overcome the obstacles ahead. With a gripping narrative and richly developed characters, this book offers an exciting and immersive exploration of the Inquisitor's journey."
  },
  {
    "type": "book",
    "title": "Attack of the Clones",
    "releaseDate": "2015-07-28T00:00:00Z",
    "chronoDate": -22,
    "author": "Geof Smith",
    "pages": 353,
    "category": "YR",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Relive the epic adventure of 'Attack of the Clones' as the Jedi and their allies face a dire threat that could plunge the galaxy into chaos. The novel follows the events of the film, exploring themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling and immersive retelling of 'Attack of the Clones,' where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "Attack of the Clones Read-Along Storybook and CD",
    "releaseDate": "2017-02-07T00:00:00Z",
    "chronoDate": -22,
    "author": "Randy Thornton",
    "pages": 35,
    "category": "YR",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Experience the adventure of 'Attack of the Clones' in a new way with this read-along storybook and CD. The novel follows the events of the film, exploring themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling and immersive retelling of 'Attack of the Clones,' where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "Queen's Hope",
    "releaseDate": "2022-04-05T00:00:00Z",
    "chronoDate": -22,
    "author": "E. K. Johnston",
    "pages": 288,
    "category": "YR",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Witness the rise of Queen Amidala as she navigates the challenges and dangers of ruling Naboo. 'Queen's Hope' follows Padmé Amidala as she faces political intrigue, threats to her reign, and the responsibilities of leadership. The novel explores themes of courage, resilience, and the pursuit of justice. As Padmé confronts various obstacles and learns valuable lessons, she must rely on her skills, wisdom, and the strength of her allies to overcome the challenges ahead. With a compelling narrative and richly developed characters, this book offers an insightful and immersive exploration of Padmé's journey and the complexities of leadership."
  },
  {
    "type": "book",
    "title": "Brotherhood",
    "releaseDate": "2022-05-10T00:00:00Z",
    "chronoDate": -22,
    "author": "Mike Chen",
    "pages": 352,
    "category": "ON",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Explore the bond between Obi-Wan Kenobi and Anakin Skywalker as they navigate the challenges of the Clone Wars. 'Brotherhood' delves into their relationship, revealing the complexities and growth that come with their unique partnership. The novel explores themes of trust, loyalty, and the pursuit of knowledge. As Obi-Wan and Anakin face various obstacles and learn valuable lessons, they must rely on their skills, wisdom, and the strength of their bond to overcome the challenges ahead."
  },
  {
    "type": "book",
    "title": "Choose Your Destiny: A Clone Trooper Mission",
    "releaseDate": "2019-06-09T00:00:00Z",
    "chronoDate": -21,
    "author": "Cavan Scott",
    "pages": 0,
    "category": "OJR",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Embark on an interactive adventure with the clone troopers of the Republic. 'Choose Your Destiny: A Clone Trooper Mission' allows readers to make choices that affect the outcome of the story. The novel explores themes of bravery, loyalty, and the importance of teamwork. As the clone troopers face various challenges, readers must decide their path and navigate the dangers of the Clone Wars."
  },
  {
    "type": "book",
    "title": "Catalyst: A Rogue One Novel",
    "releaseDate": "2016-11-15T00:00:00Z",
    "chronoDate": -21,
    "author": "James Luceno",
    "pages": 330,
    "category": "ON",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Discover the events leading up to 'Rogue One: A Star Wars Story' in 'Catalyst.' The novel follows the development of the Death Star and the complex relationships between key characters. Themes of ambition, betrayal, and the moral dilemmas of war are explored. As the characters navigate political intrigue and personal conflicts, they must make difficult choices that will shape the future of the galaxy."
  },
  {
    "type": "book",
    "title": "Forces of Destiny: Daring Adventures: Volume 1",
    "releaseDate": "2017-08-01T00:00:00Z",
    "chronoDate": -21,
    "author": "Emma Carlson Berne",
    "pages": 120,
    "category": "JRA",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Join the heroines of the Star Wars universe in 'Forces of Destiny: Daring Adventures: Volume 1.' This collection of stories highlights the bravery and resilience of characters like Leia, Rey, and Ahsoka. Themes of courage, friendship, and the fight for justice are explored. Each story showcases the unique strengths and qualities of these iconic characters as they navigate their adventures."
  },
  {
    "type": "book",
    "title": "Forces of Destiny: Daring Adventures: Volume 2",
    "releaseDate": "2017-10-03T00:00:00Z",
    "chronoDate": -21,
    "author": "Emma Carlson Berne",
    "pages": 120,
    "category": "JRA",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Continue the adventures of the Star Wars heroines in 'Forces of Destiny: Daring Adventures: Volume 2.' This collection of stories features characters like Padmé, Sabine, and Jyn. Themes of bravery, loyalty, and the fight for justice are explored. Each story highlights the unique strengths and qualities of these characters as they face new challenges and embark on daring missions."
  },
  {
    "type": "book",
    "title": "Thrawn Ascendancy: Chaos Rising",
    "releaseDate": "2020-09-01T00:00:00Z",
    "chronoDate": -19,
    "author": "Timothy Zahn",
    "pages": 400,
    "category": "ON",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Discover the origins of Thrawn in 'Thrawn Ascendancy: Chaos Rising.' The novel follows Thrawn's rise through the ranks of the Chiss Ascendancy and his early encounters with the Galactic Empire. Themes of strategy, loyalty, and the complexities of leadership are explored. As Thrawn navigates political intrigue and military challenges, he must rely on his tactical genius and strategic mind to succeed."
  },
  {
    "type": "book",
    "title": "Dark Disciple",
    "releaseDate": "2015-07-07T00:00:00Z",
    "chronoDate": -19,
    "author": "Christie Golden",
    "pages": 336,
    "category": "ON",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Follow the story of Jedi Knight Quinlan Vos and former Sith apprentice Asajj Ventress in 'Dark Disciple.' The novel explores their unlikely partnership as they embark on a mission to assassinate Count Dooku. Themes of redemption, trust, and the struggle between light and dark are explored. As Vos and Ventress navigate their complex relationship and confront their inner demons, they must make difficult choices that will impact their destinies."
  },
  {
    "type": "book",
    "title": "Revenge of the Sith",
    "releaseDate": "2015-07-28T00:00:00Z",
    "chronoDate": -19,
    "author": "Geof Smith",
    "pages": 24,
    "category": "YR",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Relive the epic conclusion of the prequel trilogy in 'Revenge of the Sith.' The novel follows the tragic fall of Anakin Skywalker and the rise of Darth Vader. Themes of power, corruption, and the struggle between light and dark are explored. As Anakin faces his inner demons and makes fateful choices, the galaxy is plunged into darkness, setting the stage for the original trilogy."
  },
  {
    "type": "book",
    "title": "Revenge of the Sith Read-Along Storybook and CD",
    "releaseDate": "2017-03-17T00:00:00Z",
    "chronoDate": -19,
    "author": "Elizabeth Schaefer",
    "pages": 32,
    "category": "YR",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Experience the adventure of 'Revenge of the Sith' in a new way with this read-along storybook and CD. The novel follows the events of the film, exploring themes of courage, resilience, and the enduring power of hope. As the characters navigate this treacherous path, they must rely on their skills, wisdom, and the strength of their bonds to overcome the challenges ahead. With a gripping narrative and richly developed characters, this book offers a thrilling and immersive retelling of 'Revenge of the Sith,' where the stakes are high and the future of the galaxy is at risk."
  },
  {
    "type": "book",
    "title": "Reign of the Empire: The Mask of Fear",
    "releaseDate": "2025-02-25T00:00:00Z",
    "chronoDate": -19,
    "author": "Alexander Freed",
    "pages": 496,
    "category": "ON",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Uncover the dark secrets of the Empire in 'The Mask of Fear.' The novel follows the rise of the Empire and the fear it instills in the galaxy. Themes of power, control, and resistance are explored. As characters navigate the oppressive regime, they must confront their fears and find the courage to fight back against tyranny."
  },
  {
    "type": "book",
    "title": "Thrawn Ascendancy: Greater Good",
    "releaseDate": "2021-04-27T00:00:00Z",
    "chronoDate": -18,
    "author": "Timothy Zahn",
    "pages": 416,
    "category": "ON",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Continue the journey of Thrawn as he navigates the complex politics and military challenges of the Chiss Ascendancy. 'Thrawn Ascendancy: Greater Good' delves deeper into Thrawn's strategic mind and his efforts to protect his people from internal and external threats. The novel explores themes of loyalty, duty, and the greater good, offering a compelling narrative that expands the Star Wars universe."
  },
  {
    "type": "book",
    "title": "Thrawn Ascendancy: Lesser Evil",
    "releaseDate": "2021-11-16T00:00:00Z",
    "chronoDate": -18,
    "author": "Timothy Zahn",
    "pages": 576,
    "category": "ON",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Witness the epic conclusion of Thrawn's journey in 'Thrawn Ascendancy: Lesser Evil.' As the Chiss Ascendancy faces its greatest threats, Thrawn must navigate treacherous waters and make difficult decisions to ensure the survival of his people. The novel explores themes of sacrifice, leadership, and the fine line between good and evil, providing a thrilling and satisfying end to the trilogy."
  },
  {
    "type": "book",
    "title": "Adventures in Wild Space: The Escape",
    "releaseDate": "2016-02-25T00:00:00Z",
    "chronoDate": -18,
    "author": "Cavan Scott",
    "pages": 96,
    "category": "OJR",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Join Milo and Lina Graf as they embark on a daring adventure to escape the clutches of the Empire in 'Adventures in Wild Space: The Escape.' The siblings must rely on their wits and courage as they navigate the dangers of Wild Space, seeking to reunite with their parents and find safety. The novel explores themes of bravery, family, and resilience, offering an exciting and engaging story for young readers."
  },
  {
    "type": "book",
    "title": "Adventures in Wild Space: The Snare",
    "releaseDate": "2016-02-25T00:00:00Z",
    "chronoDate": -18,
    "author": "Cavan Scott",
    "pages": 160,
    "category": "OJR",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Continue the thrilling journey of Milo and Lina Graf in 'Adventures in Wild Space: The Snare.' As they evade the Empire's grasp, the siblings encounter new allies and face dangerous traps. The novel explores themes of trust, perseverance, and the fight for freedom, providing an action-packed and captivating story for young readers."
  },
  {
    "type": "book",
    "title": "Adventures in Wild Space: The Nest",
    "releaseDate": "2016-02-25T00:00:00Z",
    "chronoDate": -18,
    "author": "Tom Huddleston",
    "pages": 160,
    "category": "OJR",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Join Milo and Lina Graf as they venture into uncharted territory in 'Adventures in Wild Space: The Nest.' The siblings must navigate treacherous landscapes and confront new threats as they seek to uncover the secrets of Wild Space. The novel explores themes of exploration, courage, and the bonds of family, offering an exciting and immersive story for young readers."
  },
  {
    "type": "book",
    "title": "Adventures in Wild Space: The Steal",
    "releaseDate": "2016-06-30T00:00:00Z",
    "chronoDate": -18,
    "author": "Cavan Scott",
    "pages": 160,
    "category": "OJR",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Embark on a daring heist with Milo and Lina Graf in 'Adventures in Wild Space: The Steal.' As they continue their quest to evade the Empire, the siblings must outsmart their enemies and secure valuable resources. The novel explores themes of ingenuity, teamwork, and the fight for survival, providing an engaging and thrilling story for young readers."
  },
  {
    "type": "book",
    "title": "Adventures in Wild Space: The Dark",
    "releaseDate": "2016-06-30T00:00:00Z",
    "chronoDate": -18,
    "author": "Tom Huddleston",
    "pages": 160,
    "category": "OJR",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Face the unknown with Milo and Lina Graf in 'Adventures in Wild Space: The Dark.' As they journey deeper into Wild Space, the siblings encounter mysterious forces and hidden dangers. The novel explores themes of fear, bravery, and the quest for knowledge, offering an exciting and suspenseful story for young readers."
  },
  {
    "type": "book",
    "title": "Adventures in Wild Space: The Cold",
    "releaseDate": "2017-03-09T00:00:00Z",
    "chronoDate": -18,
    "author": "Cavan Scott",
    "pages": 160,
    "category": "OJR",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Brave the harsh elements with Milo and Lina Graf in 'Adventures in Wild Space: The Cold.' As they navigate frozen landscapes and face relentless enemies, the siblings must rely on their resourcefulness and determination to survive. The novel explores themes of resilience, adaptation, and the strength of family bonds, providing an engaging and adventurous story for young readers."
  },
  {
    "type": "book",
    "title": "Adventures in Wild Space: The Rescue",
    "releaseDate": "2017-05-04T00:00:00Z",
    "chronoDate": -18,
    "author": "Tom Huddleston",
    "pages": 192,
    "category": "OJR",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Join Milo and Lina Graf in their final adventure in 'Adventures in Wild Space: The Rescue.' As they attempt a daring rescue mission, the siblings must confront their greatest challenges and make difficult choices. The novel explores themes of heroism, sacrifice, and the enduring power of hope, offering a thrilling and satisfying conclusion to the series."
  },
  {
    "type": "book",
    "title": "Ahsoka",
    "releaseDate": "2016-10-11T00:00:00Z",
    "chronoDate": -18,
    "author": "E. K. Johnston",
    "pages": 356,
    "category": "OJR",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Follow the journey of Ahsoka Tano as she navigates life after leaving the Jedi Order in 'Ahsoka.' The novel explores her struggles to find her place in the galaxy, her efforts to help those in need, and her confrontation with the dark forces of the Empire. Themes of identity, resilience, and the fight for justice are central to this compelling and inspiring story."
  },
  {
    "type": "book",
    "title": "Reign of the Empire Book Two",
    "releaseDate": "2026-05-01T00:00:00Z",
    "chronoDate": -18,
    "author": "Rebecca Roanhorse",
    "pages": null,
    "category": "ON",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Continue the thrilling adventure of the Empire in 'Reign of the Empire Book Two.' The novel follows the rise of the Empire and the challenges faced by those who resist its rule. Themes of power, rebellion, and the fight for freedom are explored. As characters navigate the treacherous landscape of the galaxy, they must confront their fears and find the courage to stand up against tyranny."
  },
  {
    "type": "book",
    "title": "Thrawn",
    "releaseDate": "2017-04-13T00:00:00Z",
    "chronoDate": -15,
    "author": "Timothy Zahn",
    "pages": 427,
    "category": "ON",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Discover the origins of Thrawn in 'Thrawn.' The novel follows Thrawn's rise through the ranks of the Empire and his encounters with key figures like Emperor Palpatine and Darth Vader. Themes of strategy, loyalty, and the complexities of leadership are explored. As Thrawn navigates political intrigue and military challenges, he must rely on his tactical genius and strategic mind to succeed."
  },
  {
    "type": "book",
    "title": "Lords of the Sith",
    "releaseDate": "2015-04-28T00:00:00Z",
    "chronoDate": -14,
    "author": "Paul S. Kemp",
    "pages": 320,
    "category": "ON",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Witness the power of the Sith in 'Lords of the Sith.' The novel follows Darth Vader and Emperor Palpatine as they face a rebellion on the planet Ryloth. Themes of power, control, and the dark side of the Force are explored. As the Sith Lords confront their enemies and navigate treacherous territory, they must rely on their skills, cunning, and the strength of their connection to the dark side to overcome the challenges ahead."
  },
  {
    "type": "book",
    "title": "Tarkin",
    "releaseDate": "2014-11-04T00:00:00Z",
    "chronoDate": -14,
    "author": "James Luceno",
    "pages": 288,
    "category": "ON",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Explore the life of Grand Moff Tarkin in 'Tarkin.' The novel delves into Tarkin's rise through the ranks of the Empire and his complex relationship with Darth Vader. Themes of power, ambition, and the pursuit of order are explored. As Tarkin navigates political intrigue and military challenges, he must rely on his strategic mind and ruthless tactics to maintain control and enforce the will of the Emperor."
  },
  {
    "type": "book",
    "title": "Most Wanted",
    "releaseDate": "2018-05-25T00:00:00Z",
    "chronoDate": -13,
    "author": "Rae Carson",
    "pages": 288,
    "category": "YA",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Join Han Solo and Qi'ra on a thrilling adventure in 'Most Wanted.' The novel follows the duo as they navigate the criminal underworld of Corellia and face dangerous enemies. Themes of friendship, loyalty, and the pursuit of freedom are central to this exciting and immersive story. As Han and Qi'ra confront various obstacles and learn valuable lessons, they must rely on their skills, cunning, and the strength of their bond to overcome the challenges ahead."
  },
  {
    "type": "book",
    "title": "Lando's Luck",
    "releaseDate": "2018-10-02T00:00:00Z",
    "chronoDate": -11,
    "author": "Justina Ireland",
    "pages": 288,
    "category": "OJR",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Embark on a daring heist with Lando Calrissian in 'Lando's Luck.' The novel follows Lando and his droid companion L3-37 as they navigate the dangers of the galaxy and face formidable foes. Themes of risk, reward, and the pursuit of fortune are explored. As Lando and L3-37 confront treacherous enemies and navigate dangerous territory, they must rely on their skills, cunning, and the strength of their bond to achieve their goals."
  },
  {
    "type": "book",
    "title": "Solo: A Star Wars Story: Expanded Edition",
    "releaseDate": "2019-04-30T00:00:00Z",
    "chronoDate": -13,
    "author": "Mur Lafferty",
    "pages": 304,
    "category": "NA",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Experience the adventure of 'Solo: A Star Wars Story' in a new way with the expanded edition novel. The book follows Han Solo's journey from a young pilot on Corellia to a daring smuggler in the galaxy. Themes of friendship, loyalty, and the pursuit of freedom are central to this exciting and immersive story. As Han confronts various challenges and learns valuable lessons, he must rely on his skills, cunning, and the strength of his allies to overcome the obstacles ahead."
  },
  {
    "type": "book",
    "title": "Solo: A Star Wars Story: A Junior Novel",
    "releaseDate": "2018-09-04T00:00:00Z",
    "chronoDate": -13,
    "author": "Joe Schreiber",
    "pages": 208,
    "category": "JRA",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Join Han Solo on a thrilling adventure in 'Solo: A Star Wars Story: A Junior Novel.' The book follows Han's journey from a young pilot on Corellia to a daring smuggler in the galaxy. Themes of friendship, loyalty, and the pursuit of freedom are central to this exciting and immersive story. As Han confronts various challenges and learns valuable lessons, he must rely on his skills, cunning, and the strength of his allies to overcome the obstacles ahead."
  },
  {
    "type": "book",
    "title": "Solo: A Star Wars Story Read-Along Storybook and CD",
    "releaseDate": "2018-09-04T00:00:00Z",
    "chronoDate": -13,
    "author": "Nate Millici",
    "pages": 0,
    "category": "YR",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Experience the adventure of 'Solo: A Star Wars Story' in a new way with this read-along storybook and CD. The novel follows Han Solo's journey from a young pilot on Corellia to a daring smuggler in the galaxy. Themes of friendship, loyalty, and the pursuit of freedom are central to this exciting and immersive story. As Han confronts various challenges and learns valuable lessons, he must rely on his skills, cunning, and the strength of his allies to overcome the obstacles ahead."
  },
  {
    "type": "book",
    "title": "Solo: A Star Wars Story - Little Golden Book",
    "releaseDate": "2018-12-24T00:00:00Z",
    "chronoDate": -13,
    "author": "Barbara Winthrop",
    "pages": 24,
    "category": "YR",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Join Han Solo on a thrilling adventure in the 'Solo: A Star Wars Story' Little Golden Book. The book follows Han's journey from a young pilot on Corellia to a daring smuggler in the galaxy. Themes of friendship, loyalty, and the pursuit of freedom are central to this exciting and immersive story. As Han confronts various challenges and learns valuable lessons, he must rely on his skills, cunning, and the strength of his allies to overcome the obstacles ahead."
  },
  {
    "type": "book",
    "title": "Solo: A Star Wars Story: Train Heist",
    "releaseDate": "2018-05-25T00:00:00Z",
    "chronoDate": -13,
    "author": "Ella Patrick",
    "pages": 24,
    "category": "YR",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Join Han Solo and his crew on a daring train heist in 'Solo: A Star Wars Story: Train Heist.' The novel follows Han's team as they attempt to steal valuable resources from the Empire. Themes of risk, reward, and the pursuit of fortune are explored. As the crew confronts treacherous enemies and navigates dangerous territory, they must rely on their skills, cunning, and the strength of their bond to achieve their goals."
  },
  {
    "type": "book",
    "title": "Rebel Rising",
    "releaseDate": "2017-05-02T00:00:00Z",
    "chronoDate": -13,
    "author": "Beth Revis",
    "pages": 410,
    "category": "YR",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Follow the journey of Jyn Erso in 'Rebel Rising.' The novel explores Jyn's life from childhood to her time with Saw Gerrera's Partisans. Themes of rebellion, sacrifice, and the fight for justice are central to this compelling and emotional story. As Jyn confronts her past and navigates the challenges of the galaxy, she must rely on her skills, resilience, and the strength of her convictions to overcome the obstacles ahead."
  },
  {
    "type": "book",
    "title": "Crimson Climb",
    "releaseDate": "2023-10-10T00:00:00Z",
    "chronoDate": -13,
    "author": "E. K. Johnston",
    "pages": 368,
    "category": "YA",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Crimson Climb is a young adult novel by E.K. Johnston that delves into Qi'ra's journey within the Star Wars universe, focusing on her rise within the Crimson Dawn crime syndicate. The narrative begins with Qi'ra's return to the White Worms gang after a failed escape attempt with Han Solo, highlighting her struggle for survival on Corellia. Her fortunes change when she's sold to Sarkin Enneb, a trafficker who subjects her to harsh conditions. However, Qi'ra's resilience catches the attention of Crimson Dawn, leading to her recruitment by Dryden Vos, the syndicate's enigmatic leader. Under Vos's mentorship, Qi'ra navigates the treacherous world of organized crime, undertaking perilous missions and confronting internal betrayals. Throughout her ascent, she grapples with her past, her ambitions, and the sacrifices required to secure her position. The novel culminates with Qi'ra solidifying her role as a key figure in Crimson Dawn, setting the stage for her future encounters in the Star Wars saga."
  },
  {
    "type": "book",
    "title": "A New Dawn",
    "releaseDate": "2014-09-02T00:00:00Z",
    "chronoDate": -11,
    "author": "John Jackson Miller",
    "pages": 400,
    "category": "YA",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Discover the origins of Kanan Jarrus and Hera Syndulla in 'A New Dawn.' The novel follows the unlikely partnership between the former Jedi Padawan and the Twi'lek pilot as they confront the forces of the Empire. Themes of friendship, loyalty, and the fight for justice are central to this thrilling and immersive story. As Kanan and Hera face various challenges and learn valuable lessons, they must rely on their skills, cunning, and the strength of their bond to overcome the obstacles ahead."
  },
  {
    "type": "book",
    "title": "Jedi: Battle Scars",
    "releaseDate": "2023-03-07T00:00:00Z",
    "chronoDate": -11,
    "author": "Sam Maggs",
    "pages": 304,
    "category": "YA",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Jedi: Battle Scars is a young adult novel by Sam Maggs that explores the journey of Padawan Reath Silas within the Star Wars universe. The narrative follows Reath as he embarks on a mission to the planet Elphrona, where he encounters the Nihil, a ruthless group of marauders. Reath's journey is marked by challenges that test his courage, resilience, and loyalty to the Jedi Order. As he navigates the dangers of the galaxy and confronts the dark side of the Force, Reath must rely on his training, wisdom, and the strength of his convictions to overcome the obstacles ahead. Jedi: Battle Scars offers an engaging and immersive story that delves into the complexities of the Jedi path and the enduring struggle between light and dark."
  },
  {
    "type": "book",
    "title": "Choose Your Destiny: A Podracer Mission",
    "releaseDate": "2019-06-09T00:00:00Z",
    "chronoDate": -32,
    "author": "Cavan Scott",
    "pages": 304,
    "category": "OJR",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Choose Your Destiny: A Podracer Mission is a young adult novel by Cavan Scott that invites readers to embark on an interactive adventure within the Star Wars universe. The narrative follows the thrilling exploits of a podracer as they navigate the dangerous tracks of the galaxy. Readers are presented with choices that shape the outcome of the story, allowing them to experience the excitement and challenges of podracing firsthand. Themes of courage, determination, and the pursuit of victory are central to this engaging and immersive tale. As readers make decisions that impact the podracer's journey, they must rely on their instincts, skills, and the strength of their resolve to overcome the obstacles ahead."
  },
  {
    "type": "book",
    "title": "Lost Stars",
    "releaseDate": "2015-09-04T00:00:00Z",
    "chronoDate": -6,
    "author": "Claudia Gray",
    "pages": 304,
    "category": "YA",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Experience the epic romance of Thane Kyrell and Ciena Ree in 'Lost Stars.' The novel follows the childhood friends as they navigate the challenges of the Galactic Empire and the Rebel Alliance. Themes of love, loyalty, and the struggle between light and dark are explored. As Thane and Ciena confront their conflicting loyalties and make difficult choices, they must rely on their bond and the enduring power of their love to overcome the obstacles ahead."
  },
  {
    "type": "book",
    "title": "Servants of the Empire: Edge of the Galaxy",
    "releaseDate": "2014-10-21T00:00:00Z",
    "chronoDate": -6,
    "author": "Jason Fry",
    "pages": 176,
    "category": "YA",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Join Zare Leonis on a thrilling adventure in 'Servants of the Empire: Edge of the Galaxy.' The novel follows Zare as he enrolls in the Imperial Academy and uncovers the dark secrets of the Empire. Themes of loyalty, betrayal, and the fight for justice are central to this exciting and immersive story. As Zare navigates the challenges of the Academy and confronts the truth about the Empire, he must rely on his skills, cunning, and the strength of his convictions to overcome the obstacles ahead."
  },
  {
    "type": "comic",
    "title": "Darth Vader",
    "releaseDate": "2017-06-17T00:00:00Z",
    "chronoDate": -19,
    "writer": "Charles Soule",
    "series": "Darth Vader",
    "issues": 25,
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Explore the dark and complex journey of Darth Vader as he navigates the challenges of the Empire and confronts his inner demons. 'Star Wars: Darth Vader' delves into the psyche of one of the most iconic villains in the Star Wars universe. The comic series explores themes of power, redemption, and the struggle between light and dark. As Darth Vader faces various obstacles and learns valuable lessons, he must rely on his skills, cunning, and the strength of his connection to the dark side to overcome the challenges ahead. With a gripping narrative and richly developed characters, this comic series offers an exciting and immersive exploration of Darth Vader's journey."
  },
  {
    "type": "comic",
    "title": "The High Republic — The Blade",
    "releaseDate": "2022-12-28T00:00:00Z",
    "chronoDate": -382,
    "writer": "Charles Soule",
    "series": "The Blade",
    "issues": 4,
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Join the Jedi of the High Republic as they face a new threat in 'The Blade.' The comic series follows the adventures of Jedi Master Sskeer and his Padawan Keeve Trennis as they investigate a mysterious disturbance in the Force. Themes of courage, teamwork, and the pursuit of knowledge are central to this thrilling and immersive story. As the Jedi confront dark forces and navigate treacherous territory, they must rely on their skills, wisdom, and the strength of their bond to overcome the challenges ahead."
  },
  {
    "type": "comic",
    "title": "The High Republic Adventures",
    "releaseDate": "2022-12-28T00:00:00Z",
    "chronoDate": -382,
    "writer": "Daniel José Older",
    "issues": 8,
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Embark on an exciting adventure with the young heroes of the High Republic in 'The High Republic Adventures.' The comic series follows the Padawans Lula Talisola and Zeen Mrala as they navigate the challenges of the galaxy. Themes of friendship, bravery, and the fight for justice are central to this engaging and immersive story. As the young heroes face various obstacles and learn valuable lessons, they must rely on their skills, wisdom, and the strength of their bond to overcome the challenges ahead."
  },
  {
    "type": "comic",
    "title": "Peace and Unity",
    "releaseDate": "2022-10-12T00:00:00Z",
    "chronoDate": -382,
    "writer": "Cavan Scott",
    "issues": 1,
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Join the Jedi of the High Republic as they strive to maintain peace and unity in the galaxy. 'Peace and Unity' explores the challenges and triumphs of the Jedi as they navigate the complexities of the Force and the responsibilities of their role. Themes of harmony, balance, and the pursuit of justice are central to this inspiring and thought-provoking story. As the Jedi face various obstacles and learn valuable lessons, they must rely on their skills, wisdom, and the strength of their connection to the Force to overcome the challenges ahead."
  },
  {
    "type": "comic",
    "title": "The High Republic",
    "releaseDate": "2022-10-12T00:00:00Z",
    "chronoDate": -382,
    "writer": "Cavan Scott",
    "series": "The High Republic",
    "issues": 10,
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Embark on an epic journey with the Jedi of the High Republic in 'The High Republic.' The comic series follows the adventures of Jedi Master Avar Kriss and her allies as they confront dark forces and navigate treacherous territory. Themes of courage, resilience, and the pursuit of knowledge are central to this thrilling and immersive story. As the Jedi face various challenges and learn valuable lessons, they must rely on their skills, wisdom, and the strength of their bond to overcome the obstacles ahead."
  },
  {
    "type": "comic",
    "title": "Set For Life",
    "releaseDate": "2021-12-15T00:00:00Z",
    "chronoDate": -247,
    "writer": "Charles Soule",
    "series": "The High Republic Adventures Annual 2021",
    "issues": 1,
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Join the Jedi of the High Republic as they embark on a thrilling adventure in 'The High Republic Adventures Annual 2021.' The comic series follows the Padawans Lula Talisola and Zeen Mrala as they investigate a mysterious disturbance in the Force. Themes of courage, teamwork, and the pursuit of knowledge are central to this engaging and immersive story. As the young heroes face various obstacles and learn valuable lessons, they must rely on their skills, wisdom, and the strength of their bond to overcome the challenges ahead."
  },
  {
    "type": "comic",
    "title": "No Stone Unturned",
    "releaseDate": "2021-12-15T00:00:00Z",
    "chronoDate": -247,
    "writer": "Claudia Gray",
    "series": "The High Republic Adventures Annual 2021",
    "issues": 1,
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Join the Jedi of the High Republic as they embark on a thrilling adventure in 'The High Republic Adventures Annual 2021.' The comic series follows the Padawans Lula Talisola and Zeen Mrala as they investigate a mysterious disturbance in the Force. Themes of courage, teamwork, and the pursuit of knowledge are central to this engaging and immersive story. As the young heroes face various obstacles and learn valuable lessons, they must rely on their skills, wisdom, and the strength of their bond to overcome the challenges ahead."
  },
  {
    "type": "comic",
    "title": "First Mission",
    "releaseDate": "2021-12-15T00:00:00Z",
    "chronoDate": -233,
    "writer": "Justina Ireland",
    "series": "The High Republic Adventures Annual 2021",
    "issues": 1,
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Join the Jedi of the High Republic as they embark on a thrilling adventure in 'The High Republic Adventures Annual 2021.' The comic series follows the Padawans Lula Talisola and Zeen Mrala as they investigate a mysterious disturbance in the Force. Themes of courage, teamwork, and the pursuit of knowledge are central to this engaging and immersive story. As the young heroes face various obstacles and learn valuable lessons, they must rely on their skills, wisdom, and the strength of their bond to overcome the challenges ahead."
  },
  {
    "type": "comic",
    "title": "Crash and the Crew Do What They Do",
    "releaseDate": "2021-12-15T00:00:00Z",
    "chronoDate": -231,
    "writer": "Daniel José Older",
    "series": "The High Republic Adventures Annual 2021",
    "issues": 1,
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Join the Jedi of the High Republic as they embark on a thrilling adventure in 'The High Republic Adventures Annual 2021.' The comic series follows the Padawans Lula Talisola and Zeen Mrala as they investigate a mysterious disturbance in the Force. Themes of courage, teamwork, and the pursuit of knowledge are central to this engaging and immersive story. As the young heroes face various obstacles and learn valuable lessons, they must rely on their skills, wisdom, and the strength of their bond to overcome the challenges ahead."
  },
  {
    "type": "comic",
    "title": "The Haul",
    "releaseDate": "2021-12-15T00:00:00Z",
    "chronoDate": -231,
    "writer": "Cavan Scott",
    "series": "The High Republic Adventures Annual 2021",
    "issues": 1,
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Join the Jedi of the High Republic as they embark on a thrilling adventure in 'The High Republic Adventures Annual 2021.' The comic series follows the Padawans Lula Talisola and Zeen Mrala as they investigate a mysterious disturbance in the Force. Themes of courage, teamwork, and the pursuit of knowledge are central to this engaging and immersive story. As the young heroes face various obstacles and learn valuable lessons, they must rely on their skills, wisdom, and the strength of their bond to overcome the challenges ahead."
  },
  {
    "type": "movie",
    "title": "Star Wars: A New Hope (Episode IV)",
    "releaseDate": "1977-05-25T00:00:00Z",
    "chronoDate": 0,
    "director": "George Lucas",
    "length": 121,
    "rating": "PG",
    "era": "Age of Rebellion",
    "visible": true,
    "synopsis": "Experience the epic adventure that started it all in 'Star Wars: A New Hope.' Follow the journey of Luke Skywalker as he discovers his destiny and joins the Rebel Alliance in their fight against the evil Galactic Empire. Alongside Princess Leia, Han Solo, and Obi-Wan Kenobi, Luke embarks on a daring mission to destroy the Death Star and restore hope to the galaxy. The film explores themes of heroism, friendship, and the struggle between good and evil. With iconic characters, groundbreaking special effects, and a timeless story, 'A New Hope' remains a beloved classic that continues to inspire generations of fans."
  },
  {
    "type": "movie",
    "title": "Star Wars: The Empire Strikes Back (Episode V)",
    "releaseDate": "1980-05-21T00:00:00Z",
    "chronoDate": 3,
    "director": "Irvin Kershner",
    "length": 124,
    "rating": "PG",
    "era": "Age of Rebellion",
    "visible": true,
    "synopsis": "Witness the dark and thrilling continuation of the Star Wars saga in 'The Empire Strikes Back.' As the Rebel Alliance faces devastating losses, Luke Skywalker trains with Jedi Master Yoda to become a Jedi Knight. Meanwhile, Han Solo, Princess Leia, and their friends evade the relentless pursuit of Darth Vader and the Imperial forces. The film explores themes of perseverance, sacrifice, and the power of the Force. With stunning visuals, intense action sequences, and a shocking revelation, 'The Empire Strikes Back' is widely regarded as one of the greatest sequels in cinematic history."
  },
  {
    "type": "movie",
    "title": "Star Wars: Return of the Jedi (Episode VI)",
    "releaseDate": "1983-05-25T00:00:00Z",
    "chronoDate": 4,
    "director": "Richard Marquand",
    "length": 135,
    "rating": "PG",
    "era": "Age of Rebellion",
    "visible": true,
    "synopsis": "Experience the thrilling conclusion of the original Star Wars trilogy in 'Return of the Jedi.' As the Rebel Alliance prepares for a final battle against the Galactic Empire, Luke Skywalker confronts Darth Vader and Emperor Palpatine in a climactic showdown. With the help of his friends, including Princess Leia, Han Solo, and the Ewoks, Luke strives to bring balance to the Force and restore peace to the galaxy. The film explores themes of redemption, courage, and the enduring power of hope. With epic battles, emotional moments, and a satisfying resolution, 'Return of the Jedi' is a fitting end to the beloved saga."
  },
  {
    "type": "movie",
    "title": "Star Wars: The Phantom Menace (Episode I)",
    "releaseDate": "1999-05-19T00:00:00Z",
    "chronoDate": -32,
    "director": "George Lucas",
    "length": 134,
    "rating": "PG",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Journey to the beginning of the Star Wars saga in 'The Phantom Menace.' Follow the adventures of Jedi Master Qui-Gon Jinn and his apprentice Obi-Wan Kenobi as they discover a young slave named Anakin Skywalker, who possesses extraordinary potential in the Force. As they navigate political intrigue and confront the sinister Sith Lord Darth Maul, the Jedi strive to protect the galaxy from impending darkness. The film explores themes of destiny, courage, and the balance between light and dark. With groundbreaking special effects, thrilling action sequences, and a rich tapestry of characters, 'The Phantom Menace' sets the stage for the epic saga to come."
  },
  {
    "type": "movie",
    "title": "Star Wars: Attack of the Clones (Episode II)",
    "releaseDate": "2002-05-16T00:00:00Z",
    "chronoDate": -22,
    "director": "George Lucas",
    "length": 142,
    "rating": "PG",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Experience the escalating conflict and forbidden romance in 'Attack of the Clones.' As the galaxy teeters on the brink of war, Jedi Knight Anakin Skywalker and Senator Padmé Amidala navigate their growing feelings for each other while uncovering a sinister plot that threatens the Republic. Meanwhile, Obi-Wan Kenobi investigates the creation of a mysterious clone army. The film explores themes of love, loyalty, and the consequences of power. With stunning visuals, epic battles, and a deepening narrative, 'Attack of the Clones' delves into the complexities of the Star Wars universe and sets the stage for the rise of the Sith."
  },
  {
    "type": "movie",
    "title": "Star Wars: Revenge of the Sith (Episode III)",
    "releaseDate": "2005-05-19T00:00:00Z",
    "chronoDate": -19,
    "director": "George Lucas",
    "length": 140,
    "rating": "PG-13",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Witness the tragic fall of Anakin Skywalker and the rise of Darth Vader in 'Revenge of the Sith.' As the Clone Wars rage on, Anakin is torn between his loyalty to the Jedi Order and his desire to save his loved ones from a dark fate. Manipulated by the sinister Emperor Palpatine, Anakin's choices lead him down a path of destruction and betrayal. The film explores themes of power, corruption, and the struggle between light and dark. With intense action, emotional depth, and a powerful conclusion, 'Revenge of the Sith' brings the prequel trilogy to a dramatic and heartbreaking close."
  },
  {
    "type": "movie",
    "title": "Star Wars: The Force Awakens (Episode VII)",
    "releaseDate": "2015-12-18T00:00:00Z",
    "chronoDate": 34,
    "director": "J. J. Abrams",
    "length": 138,
    "rating": "PG-13",
    "era": "Rise of the First Order",
    "visible": true,
    "synopsis": "Embark on a new adventure in 'The Force Awakens.' Set thirty years after the defeat of the Galactic Empire, the galaxy faces a new threat from the sinister First Order. Join Rey, a scavenger with a mysterious past, as she teams up with Finn, a former stormtrooper, and Han Solo to find the missing Luke Skywalker and restore hope to the galaxy. The film explores themes of legacy, identity, and the enduring power of the Force. With thrilling action, beloved characters, and a fresh narrative, 'The Force Awakens' revitalizes the Star Wars saga for a new generation."
  },
  {
    "type": "movie",
    "title": "Star Wars: The Last Jedi (Episode VIII)",
    "releaseDate": "2017-12-15T00:00:00Z",
    "chronoDate": 34,
    "director": "Rian Johnson",
    "length": 152,
    "rating": "PG-13",
    "era": "Rise of the First Order",
    "visible": true,
    "synopsis": "Experience the epic continuation of the Star Wars saga in 'The Last Jedi.' As the Resistance faces dire threats from the First Order, Rey seeks guidance from the reclusive Luke Skywalker to understand her place in the galaxy. Meanwhile, Kylo Ren grapples with his inner conflict and the legacy of his family. The film explores themes of failure, redemption, and the balance between light and dark. With stunning visuals, complex characters, and unexpected twists, 'The Last Jedi' challenges conventions and deepens the mythology of the Star Wars universe."
  },
  {
    "type": "movie",
    "title": "Star Wars: The Rise of Skywalker (Episode IX)",
    "releaseDate": "2019-12-20T00:00:00Z",
    "chronoDate": 35,
    "director": "J. J. Abrams",
    "length": 142,
    "rating": "PG-13",
    "era": "Rise of the First Order",
    "visible": true,
    "synopsis": "Witness the epic conclusion of the Skywalker saga in 'The Rise of Skywalker.' As the Resistance faces its final battle against the First Order, Rey confronts her true heritage and the dark legacy of Emperor Palpatine. With the help of her friends, including Finn, Poe, and Kylo Ren, Rey strives to bring balance to the Force and restore peace to the galaxy. The film explores themes of legacy, redemption, and the enduring power of hope. With thrilling action, emotional moments, and a satisfying resolution, 'The Rise of Skywalker' brings the beloved saga to a triumphant close."
  },
  {
    "type": "movie",
    "title": "Star Wars: The Clone Wars",
    "releaseDate": "2008-08-15T00:00:00Z",
    "chronoDate": -22,
    "director": "Dave Filoni",
    "length": 98,
    "rating": "PG",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Dive into the animated adventures of 'Star Wars: The Clone Wars.' Set between 'Attack of the Clones' and 'Revenge of the Sith,' the film follows Jedi Knights Anakin Skywalker and Obi-Wan Kenobi as they lead the Republic's clone army against the Separatist forces. Alongside new characters like Ahsoka Tano, the Jedi navigate the complexities of war and confront the dark machinations of the Sith. The film explores themes of loyalty, sacrifice, and the struggle between light and dark. With dynamic animation, thrilling action, and a rich narrative, 'The Clone Wars' expands the Star Wars universe and sets the stage for the acclaimed TV series."
  },
  {
    "type": "movie",
    "title": "Solo: A Star Wars Story",
    "releaseDate": "2018-05-10T00:00:00Z",
    "chronoDate": -13,
    "director": "Ron Howard",
    "length": 135,
    "rating": "PG-13",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Join the daring adventures of a young Han Solo in 'Solo: A Star Wars Story.' Discover the origins of the iconic smuggler as he navigates the criminal underworld, forms alliances with characters like Chewbacca and Lando Calrissian, and undertakes a high-stakes heist. The film explores themes of friendship, loyalty, and the quest for freedom. With thrilling action, charismatic performances, and a deeper look into the Star Wars universe, 'Solo' offers an exciting and entertaining exploration of one of the saga's most beloved characters."
  },
  {
    "type": "movie",
    "title": "Rogue One: A Star Wars Story",
    "releaseDate": "2016-12-16T00:00:00Z",
    "chronoDate": 0,
    "director": "Gareth Edwards",
    "length": 134,
    "rating": "PG-13",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Experience the untold story of the Rebel Alliance's daring mission to steal the Death Star plans in 'Rogue One: A Star Wars Story.' Follow Jyn Erso and a ragtag group of rebels as they embark on a dangerous mission to secure the plans and deliver hope to the galaxy. The film explores themes of sacrifice, courage, and the fight for freedom. With intense action, compelling characters, and a gritty portrayal of the Star Wars universe, 'Rogue One' offers a thrilling and emotional journey that bridges the gap between the prequel and original trilogies."
  },
  {
    "type": "tvshow",
    "title": "Star Wars: The Clone Wars",
    "releaseDate": "2008-10-03T00:00:00Z",
    "chronoDate": -22,
    "creator": "George Lucas",
    "episodes": 133,
    "length": 0,
    "rating": "",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Dive into the epic battles and heroic adventures of the Clone Wars as the Jedi and their allies fight to protect the galaxy from the dark forces of the Separatists. 'Star Wars: The Clone Wars' follows iconic characters like Anakin Skywalker, Obi-Wan Kenobi, and Ahsoka Tano as they navigate the complexities of war, form alliances, and confront powerful enemies. The series explores themes of loyalty, sacrifice, and the struggle between light and dark. With stunning animation, compelling storylines, and richly developed characters, this TV show offers an immersive and thrilling exploration of the Star Wars universe during one of its most tumultuous periods."
  },
  {
    "type": "tvshow",
    "title": "Star Wars: Resistance",
    "releaseDate": "2018-10-07T00:00:00Z",
    "chronoDate": 34,
    "creator": "Dave Filoni",
    "episodes": 40,
    "length": 0,
    "rating": "",
    "era": "Rise of the First Order",
    "visible": true,
    "synopsis": "Join the daring pilots of the Resistance as they fight against the sinister First Order in their quest to restore peace and justice to the galaxy. 'Star Wars: Resistance' follows Kazuda Xiono, a young pilot recruited by the Resistance, as he embarks on dangerous missions, uncovers secrets, and forms bonds with his fellow pilots. The series explores themes of bravery, friendship, and the fight against tyranny. With vibrant animation, exciting action sequences, and a diverse cast of characters, this TV show offers an engaging and adventurous look at the Star Wars universe during the rise of the First Order."
  },
  {
    "type": "tvshow",
    "title": "Star Wars: The Acolyte",
    "releaseDate": "2024-06-04T00:00:00Z",
    "chronoDate": -132,
    "creator": "Leslye Headland",
    "episodes": 8,
    "length": 0,
    "rating": "",
    "era": "The High Republic",
    "visible": true,
    "synopsis": "Uncover the dark secrets of the High Republic era as 'Star Wars: The Acolyte' delves into the rise of the Sith and the shadowy forces that threaten the galaxy. The series follows a former Padawan who reunites with her Jedi Master to investigate a series of mysterious crimes, leading them to confront dark powers and hidden dangers. The show explores themes of corruption, power, and the struggle between light and dark. With a gripping narrative, complex characters, and a richly detailed world, this TV show offers a thrilling and immersive exploration of the Star Wars universe during a time of great upheaval."
  },
  {
    "type": "tvshow",
    "title": "Star Wars: The Bad Batch",
    "releaseDate": "2021-05-04T00:00:00Z",
    "chronoDate": 19,
    "creator": "Dave Filoni",
    "episodes": 47,
    "length": 0,
    "rating": "",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Follow the elite squad of clone troopers known as the Bad Batch as they navigate the aftermath of the Clone Wars and the rise of the Galactic Empire. 'Star Wars: The Bad Batch' explores the adventures of Clone Force 99, a group of genetically enhanced clones with unique abilities, as they take on daring missions, form new alliances, and confront powerful enemies. The series delves into themes of identity, loyalty, and survival in a changing galaxy. With dynamic animation, action-packed storylines, and richly developed characters, this TV show offers an exciting and immersive exploration of the Star Wars universe during the early days of the Empire."
  },
  {
    "type": "tvshow",
    "title": "Tales of the Jedi",
    "releaseDate": "2022-10-26T00:00:00Z",
    "chronoDate": -40,
    "creator": "Dave Filoni",
    "episodes": 6,
    "length": 0,
    "rating": "",
    "era": "Fall of the Jedi",
    "visible": true,
    "synopsis": "Explore the ancient history and legendary tales of the Jedi Order in 'Tales of the Jedi.' This anthology series delves into the origins, trials, and triumphs of the Jedi, revealing the rich lore and timeless wisdom that define their legacy. Each episode focuses on different characters and events, offering a deep dive into the mythology and philosophy of the Jedi. The series explores themes of courage, sacrifice, and the enduring power of the Force. With stunning animation, compelling storytelling, and a richly detailed world, this TV show offers an immersive and enlightening exploration of the Star Wars universe through the lens of the Jedi Order."
  },
  {
    "type": "tvshow",
    "title": "Obi-Wan Kenobi",
    "releaseDate": "2022-05-27T00:00:00Z",
    "chronoDate": -9,
    "creator": "Joby Harold, Hossein Amini",
    "episodes": 6,
    "length": 0,
    "rating": "",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Join Obi-Wan Kenobi on his journey of exile and redemption as he navigates the challenges of the Galactic Empire and protects the legacy of the Jedi. 'Obi-Wan Kenobi' follows the iconic Jedi Master as he confronts old enemies, forms new alliances, and faces his own inner demons. The series explores themes of hope, resilience, and the enduring power of the Force. With a gripping narrative, complex characters, and a richly detailed world, this TV show offers an exciting and immersive exploration of Obi-Wan's journey during one of the darkest periods in the Star Wars universe."
  },
  {
    "type": "tvshow",
    "title": "Star Wars Rebels",
    "releaseDate": "2014-10-03T00:00:00Z",
    "chronoDate": -5,
    "creator": "Dave Filoni, Simon Kinberg, Carrie Beck",
    "episodes": 75,
    "length": 0,
    "rating": "",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Join the brave rebels of the Ghost crew as they fight against the tyranny of the Galactic Empire and ignite the spark of rebellion. 'Star Wars Rebels' follows a diverse group of heroes, including Ezra Bridger, Kanan Jarrus, Hera Syndulla, Sabine Wren, and Zeb Orrelios, as they embark on daring missions, form alliances, and confront powerful enemies. The series explores themes of hope, courage, and the fight for freedom. With dynamic animation, compelling storylines, and richly developed characters, this TV show offers an exciting and immersive exploration of the Star Wars universe during the early days of the Rebel Alliance."
  },
  {
    "type": "tvshow",
    "title": "Andor",
    "releaseDate": "2022-09-21T00:00:00Z",
    "chronoDate": -5,
    "creator": "Tony Gilroy",
    "episodes": 12,
    "length": 0,
    "rating": "",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Follow the journey of Cassian Andor as he transforms from a reluctant hero to a key figure in the Rebel Alliance. 'Andor' explores the early days of the rebellion, delving into the personal struggles, sacrifices, and triumphs of those who fight against the tyranny of the Galactic Empire. The series offers a gritty and realistic portrayal of the Star Wars universe, highlighting the complexities and moral ambiguities of war. With a gripping narrative, complex characters, and a richly detailed world, this TV show offers an immersive and thought-provoking exploration of the Star Wars universe during the rise of the Rebel Alliance."
  },
  {
    "type": "tvshow",
    "title": "The Mandalorian",
    "releaseDate": "2019-11-12T00:00:00Z",
    "chronoDate": 9,
    "creator": "Jon Favreau",
    "episodes": 24,
    "length": 0,
    "rating": "",
    "era": "The New Republic",
    "visible": true,
    "synopsis": "Embark on a thrilling adventure with the Mandalorian bounty hunter Din Djarin as he navigates the lawless outer reaches of the galaxy and protects a mysterious child known as Grogu. 'The Mandalorian' follows the lone warrior as he takes on dangerous missions, forms alliances, and confronts powerful enemies. The series explores themes of honor, loyalty, and the search for identity. With stunning visuals, compelling storytelling, and richly developed characters, this TV show offers an exciting and immersive exploration of the Star Wars universe during the early days of the New Republic."
  },
  {
    "type": "tvshow",
    "title": "The Book of Boba Fett",
    "releaseDate": "2021-12-29T00:00:00Z",
    "chronoDate": 9,
    "creator": "Jon Favreau",
    "episodes": 7,
    "length": 0,
    "rating": "",
    "era": "The New Republic",
    "visible": true,
    "synopsis": "Join the legendary bounty hunter Boba Fett as he takes control of the criminal underworld on Tatooine and seeks to establish his own legacy. 'The Book of Boba Fett' follows Boba and his ally Fennec Shand as they navigate the treacherous world of crime, form alliances, and confront powerful enemies. The series explores themes of power, redemption, and the quest for identity. With stunning visuals, compelling storytelling, and richly developed characters, this TV show offers an exciting and immersive exploration of the Star Wars universe during the early days of the New Republic."
  },
  {
    "type": "tvshow",
    "title": "Ahsoka",
    "releaseDate": "2023-08-22T00:00:00Z",
    "chronoDate": 11,
    "creator": "Dave Filoni, George Lucas",
    "episodes": 8,
    "length": 0,
    "rating": "",
    "era": "The New Republic",
    "visible": true,
    "synopsis": "Follow the journey of Ahsoka Tano as she navigates the challenges of the New Republic era and seeks to uncover the truth about her past. 'Ahsoka' explores the adventures of the former Jedi as she takes on dangerous missions, forms alliances, and confronts powerful enemies. The series delves into themes of identity, resilience, and the enduring power of the Force. With a gripping narrative, complex characters, and a richly detailed world, this TV show offers an exciting and immersive exploration of the Star Wars universe through the eyes of one of its most beloved characters."
  },
  {
    "type": "videogame",
    "title": "Star Wars Jedi: Fallen Order",
    "releaseDate": "2019-11-15T00:00:00Z",
    "chronoDate": 14,
    "developer": "Respawn Entertainment, Motive Studios",
    "platforms": ["PC", "PS4", "PS5", "Xbox One", "Xbox Series X/S", "Xbox Cloud Gaming"],
    "rating": "T",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Join Cal Kestis, a young Jedi, on his journey to survive the dark times of the Empire and restore hope to the galaxy. 'Star Wars Jedi: Fallen Order' follows Cal as he navigates treacherous territory, confronts formidable foes, and uncovers hidden secrets. The game explores themes of resilience, courage, and the enduring power of hope. As Cal faces various challenges and learns valuable lessons, he must rely on his skills, wisdom, and the strength of his connection to the Force to overcome the obstacles ahead. With a compelling narrative and richly developed characters, this game offers an exciting and immersive exploration of Cal's journey."
  },
  {
    "type": "videogame",
    "title": "Star Wars Jedi: Survivor",
    "releaseDate": "2023-04-28T00:00:00Z",
    "chronoDate": 9,
    "developer": "Respawn Entertainment",
    "platforms": ["Xbox Series X/S", "PS5", "PC", "Xbox One", "PS4"],
    "rating": "T",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Continue the journey of Cal Kestis as he navigates the challenges of the Empire and strives to restore hope and justice in the galaxy. 'Star Wars Jedi: Survivor' follows Cal as he faces new threats, uncovers hidden secrets, and strengthens his connection to the Force. The game explores themes of resilience, courage, and the enduring power of hope. As Cal confronts formidable foes and navigates treacherous territory, he must rely on his skills, wisdom, and the strength of his bonds to overcome the obstacles ahead. With a compelling narrative and richly developed characters, this game offers an exciting and immersive continuation of Cal's journey."
  },
  {
    "type": "videogame",
    "title": "Vader Immortal: A Star Wars VR Series",
    "releaseDate": "2019-05-21T00:00:00Z",
    "chronoDate": 1,
    "developer": "ILMxLAB",
    "platforms": ["Oculus Quest 2 & Rift", "PS VR"],
    "rating": "T",
    "era": "Reign of the Empire",
    "visible": true,
    "synopsis": "Immerse yourself in the dark and complex journey of Darth Vader as you navigate the challenges of the Empire and confront your inner demons. 'Vader Immortal: A Star Wars VR Series' offers a unique and immersive experience, allowing players to step into the shoes of one of the most iconic villains in the Star Wars universe. The game explores themes of power, redemption, and the struggle between light and dark. As players face various obstacles and learn valuable lessons, they must rely on their skills, cunning, and the strength of their connection to the dark side to overcome the challenges ahead. With a gripping narrative and richly developed characters, this VR series offers an exciting and immersive exploration of Darth Vader's journey."
  },
  {
    "type": "videogame",
    "title": "Star Wars Outlaws",
    "releaseDate": "2024-08-30T00:00:00Z",
    "chronoDate": 3,
    "developer": "Massive Entertainment",
    "platforms": ["PC", "PS5", "Xbox Series X/S"],
    "rating": "13+",
    "era": "Age of Rebellion",
    "visible": true,
    "synopsis": "Join the outlaws of the galaxy as they navigate the challenges of the Empire and embark on thrilling adventures in their quest for freedom and justice. 'Star Wars Outlaws' follows a group of renegades as they face formidable foes, uncover hidden secrets, and fight for their survival. The game explores themes of resilience, courage, and the enduring power of hope. As the outlaws confront various obstacles and learn valuable lessons, they must rely on their skills, cunning, and the strength of their bonds to overcome the challenges ahead. With a compelling narrative and richly developed characters, this game offers an exciting and immersive exploration of the Star Wars universe."
  },
  {
    "type": "videogame",
    "title": "Star Wars: Battlefront 2",
    "releaseDate": "2017-11-17T00:00:00Z",
    "chronoDate": 32,
    "developer": "DICE, Motive Studios, Criterion Games",
    "platforms": ["PC", "PS4", "Xbox One", "Xbox Cloud Gaming"],
    "rating": "13+",
    "era": "Rise of the First Order",
    "visible": true,
    "synopsis": "Experience the epic battles of the Star Wars universe as you join the fight for the galaxy and confront dark forces threatening peace and stability. 'Star Wars: Battlefront 2' offers a thrilling and immersive experience, allowing players to engage in iconic battles, pilot legendary starfighters, and wield powerful weapons. The game explores themes of courage, resilience, and the enduring power of hope. As players navigate various challenges and learn valuable lessons, they must rely on their skills, strategy, and the strength of their bonds to overcome the obstacles ahead. With a compelling narrative and richly developed characters, this game offers an exciting and immersive exploration of the Star Wars universe."
  },
  {
    "type": "videogame",
    "title": "Star Wars: Squadrons",
    "releaseDate": "2020-10-02T00:00:00Z",
    "chronoDate": 4,
    "developer": "Motive Studio",
    "platforms": ["PC", "PS4", "Xbox One", "Xbox Series X/S", "Xbox Cloud Gaming"],
    "rating": "T",
    "era": "Age of Rebellion",
    "visible": true,
    "synopsis": "Join the epic space battles of the Star Wars universe as you pilot iconic starfighters and confront dark forces threatening peace and stability. 'Star Wars: Squadrons' offers a thrilling and immersive experience, allowing players to engage in intense dogfights, strategize with their squadron, and master the art of starfighter combat. The game explores themes of courage, resilience, and the enduring power of hope. As players navigate various challenges and learn valuable lessons, they must rely on their skills, strategy, and the strength of their bonds to overcome the obstacles ahead. With a compelling narrative and richly developed characters, this game offers an exciting and immersive exploration of the Star Wars universe."
  },
  {
    "type": "videogame",
    "title": "Star Wars: Hunters",
    "releaseDate": "2024-05-14T00:00:00Z",
    "chronoDate": 9,
    "developer": "Zynga, NaturalMotion",
    "platforms": ["iOS", "iPadOS", "Android", "Nintendo Switch", "Personal computer", "Steam"],
    "rating": "T",
    "era": "The New Republic",
    "visible": true,
    "synopsis": "Join the hunters of the galaxy as they navigate the challenges of the Empire and embark on thrilling adventures in their quest for freedom and justice. 'Star Wars: Hunters' follows a group of elite warriors as they face formidable foes, uncover hidden secrets, and fight for their survival. The game explores themes of resilience, courage, and the enduring power of hope. As the hunters confront various obstacles and learn valuable lessons, they must rely on their skills, cunning, and the strength of their bonds to overcome the challenges ahead. With a compelling narrative and richly developed characters, this game offers an exciting and immersive exploration of the Star Wars universe."
  },
  {
    "type": "videogame",
    "title": "Star Wars: Droid Repair Bay",
    "releaseDate": "2017-12-06T00:00:00Z",
    "chronoDate": 34,
    "developer": "ILMxLAB",
    "platforms": ["PC"],
    "rating": "T",
    "era": "Rise of the First Order",
    "visible": true,
    "synopsis": "Experience the world of droid repair as you navigate the challenges of the galaxy and confront dark forces threatening peace and stability. 'Star Wars: Droid Repair Bay' offers a unique and immersive experience, allowing players to step into the role of a droid technician and repair iconic droids from the Star Wars universe. The game explores themes of resilience, ingenuity, and the enduring power of hope. As players face various challenges and learn valuable lessons, they must rely on their skills, creativity, and the strength of their bonds to overcome the obstacles ahead. With a compelling narrative and richly developed characters, this game offers an exciting and immersive exploration of the Star Wars universe."
  },
  {
    "type": "videogame",
    "title": "Star Wars: Tales from the Galaxy's Edge",
    "releaseDate": "2020-11-19T00:00:00Z",
    "chronoDate": 34,
    "developer": "ILMxLAB",
    "platforms": ["PS5", "PS VR2", "Meta Quest", "Meta Quest 2"],
    "rating": "T",
    "era": "Rise of the First Order",
    "visible": true,
    "synopsis": "Immerse yourself in the thrilling tales from the galaxy's edge as you navigate the challenges of the Empire and confront dark forces threatening peace and stability. 'Star Wars: Tales from the Galaxy's Edge' offers a unique and immersive experience, allowing players to step into the shoes of various characters and explore the Star Wars universe from different perspectives. The game explores themes of resilience, courage, and the enduring power of hope. As players face various challenges and learn valuable lessons, they must rely on their skills, ingenuity, and the strength of their bonds to overcome the obstacles ahead. With a compelling narrative and richly developed characters, this game offers an exciting and immersive exploration of the Star Wars universe."
  },
  {
    "type": "videogame",
    "title": "Star Wars Uprising",
    "releaseDate": "2015-09-10T00:00:00Z",
    "chronoDate": 4,
    "developer": "Kabam",
    "platforms": ["Android", "iOS"],
    "rating": "",
    "era": "Age of Rebellion",
    "visible": true,
    "synopsis": "Join the uprising against the Empire as you navigate the challenges of the galaxy and confront dark forces threatening peace and stability. 'Star Wars Uprising' follows a group of rebels as they face formidable foes, uncover hidden secrets, and fight for their survival. The game explores themes of resilience, courage, and the enduring power of hope. As the rebels confront various obstacles and learn valuable lessons, they must rely on their skills, cunning, and the strength of their bonds to overcome the challenges ahead. With a compelling narrative and richly developed characters, this game offers an exciting and immersive exploration of the Star Wars universe."
  }
]
